cf/Reports/СправкаРасчетДолиНалоговойБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>СправкаРасчетДолиНалоговойБазы</Name>
			<Comment>(регл)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыделятьЦветом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Comment>1 - БУ, 2 - НУ, 3 - БУ, ПР, ВР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраняемыеРеквизиты</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьИнуюНастройку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

cf/InformationRegisters/РасчетДолейБазыНалогаНаПрибыль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РасчетДолейБазыНалогаНаПрибыль</Name>
			<Comment>Расчет долей базы налога на прибыль</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоляНалоговойБазы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыПоОплатеТруда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьАмортизируемогоИмущества</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьОСПрошлыхМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьОССледующегоМесяца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВИФНС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацияВИФНС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Reports/СправкаРасчетДолиНалоговойБазы/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
	Перем НП Экспорт;
	
	Функция СформироватьТекстЗапроса()
		
		Текст	= "ВЫБРАТЬ
		     	  |	РасчетДолейБазыНалогаНаПрибыль.РегистрацияВИФНС КАК РегистрацияВИФНС,
		     	  |	РасчетДолейБазыНалогаНаПрибыль.ДоляНалоговойБазы КАК ДоляНалоговойБазы,
		     	  |	РасчетДолейБазыНалогаНаПрибыль.РасходыПоОплатеТруда КАК РасходыПоОплатеТруда,
		     	  |	РасчетДолейБазыНалогаНаПрибыль.СтоимостьАмортизируемогоИмущества КАК СтоимостьАмортизируемогоИмущества,
		     	  |	РасчетДолейБазыНалогаНаПрибыль.СтоимостьОСПрошлыхМесяцев КАК Стоимость1,
		     	  |	РасчетДолейБазыНалогаНаПрибыль.СтоимостьОССледующегоМесяца КАК Стоимость2
		     	  |ИЗ
		     	  |	РегистрСведений.РасчетДолейБазыНалогаНаПрибыль КАК РасчетДолейБазыНалогаНаПрибыль
		     	  |ГДЕ
		     	  |	РасчетДолейБазыНалогаНаПрибыль.ПериодРасчета МЕЖДУ &ДатаНач И &ДатаКон
		     	  |	И РасчетДолейБазыНалогаНаПрибыль.Организация = &Организация
		     	  |
		     	  |УПОРЯДОЧИТЬ ПО
		     	  |	РегистрацияВИФНС";
		
		Возврат Текст;
		
	КонецФункции
	
	// Выполняет запрос и формирует табличный документ-результат отчета
	// в соответствии с настройками, заданными значениями реквизитов отчета.
	//
	// Параметры:
	//	ДокументРезультат - табличный документ, формируемый отчетом
	//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета
	//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках 
	//
	Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь, НачалоПодписи, ПоказыватьПодписи) Экспорт
		
		ДатаНач = НачалоМесяца(ПериодРегистрации);
		ДатаКон  = КонецМесяца(ПериодРегистрации);
		Если ДатаНач > ДатаКон И ДатаКон <> '00010101000000' Тогда
			Предупреждение("Дата начала периода не может быть больше даты окончания периода");
			Возврат;
		КонецЕсли;
		
		НачалоПериода = НачалоДня(ДатаНач);
		КонецПериода  = КонецДня(ДатаКон);
		
		ДокументРезультат.Очистить();
		
		Макет      = ПолучитьМакет("Отчет");
		МакетОбщий = ПолучитьОбщийМакет("СправкаРасчет");
		
		ЗаголовокОтчета = МакетОбщий.ПолучитьОбласть("Заголовок");
		ШапкаОтчета     = Макет.ПолучитьОбласть("Шапка");
		
		// Когда нужен только заголовок:
		Если ТолькоЗаголовок Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВысотаЗаголовка) Тогда
			ДокументРезультат.Область("R1:R" + ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаНач",     НачалоДня(ДатаНач));
		Запрос.УстановитьПараметр("ДатаКон",     КонецДня(ДатаКон));
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Запрос.Текст = СформироватьТекстЗапроса();
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		ОбластьШапка            = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока           = Макет.ПолучитьОбласть("Строка");
		ОбластьИтого            = Макет.ПолучитьОбласть("Итого");
		ОбластьОкончаниеТаблицы = Макет.ПолучитьОбласть("ОкончаниеТаблицы");
		
		ОбластьПодвал             = МакетОбщий.ПолучитьОбласть("Подвал");
		
		Всего = 0;
		КоэффициентМесяца = Месяц(ПериодРегистрации) + 1;
			
			ЗаголовокОтчета.Параметры.Период              = "" + ПредставлениеПериода(НачалоГода(ПериодРегистрации), КонецМесяца(ПериодРегистрации), "ФП = Истина");
			СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация);
			НазваниеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм");
			ЗаголовокОтчета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
			ЗаголовокОтчета.Параметры.ДатаСоставления     = КонецМесяца(ПериодРегистрации);
			ЗаголовокОтчета.Параметры.НазваниеОтчета      = "Распределение прибыли по бюджетам субъектов РФ";
			ДокументРезультат.Вывести(ЗаголовокОтчета);
			
			ШапкаОтчета.Параметры.Формула      = "гр.5 / " + КоэффициентМесяца;
			ДокументРезультат.Вывести(ШапкаОтчета);
			ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;
			
			
			Для Каждого Выборка Из Результат Цикл
				
				ОбластьСтрока.Параметры.ОбособленноеПодразделение = ?(ЗначениеЗаполнено(Выборка.РегистрацияВИФНС), Выборка.РегистрацияВИФНС.НаименованиеИФНС, Организация.РегистрацияВИФНС.НаименованиеИФНС);
				ОбластьСтрока.Параметры.РасходыПоОплатеТруда = Выборка.РасходыПоОплатеТруда;
				ОбластьСтрока.Параметры.СтоимостьАмортизируемогоИмущества = Выборка.СтоимостьАмортизируемогоИмущества;
				ОбластьСтрока.Параметры.СтоимостьАмортизируемогоИмущества1 = Выборка.Стоимость1;
				ОбластьСтрока.Параметры.СтоимостьАмортизируемогоИмущества2 = Выборка.Стоимость2;
				ОбластьСтрока.Параметры.СтоимостьАмортизируемогоИмущества3 = Выборка.Стоимость1 + Выборка.Стоимость2;
				ОбластьСтрока.Параметры.ДоляНалоговойБазы = Выборка.ДоляНалоговойБазы;
				ДокументРезультат.Вывести(ОбластьСтрока);
				
			КонецЦикла; 
			
			ОбластьИтого.Параметры.РасходыПоОплатеТруда              = Результат.Итог("РасходыПоОплатеТруда");
			ОбластьИтого.Параметры.СтоимостьАмортизируемогоИмущества = Результат.Итог("СтоимостьАмортизируемогоИмущества");
			ОбластьИтого.Параметры.ДоляНалоговойБазы = Результат.Итог("ДоляНалоговойБазы");
			ДокументРезультат.Вывести(ОбластьИтого);
			
			ДокументРезультат.Вывести(ОбластьОкончаниеТаблицы);
			
			ДокументРезультат.Вывести(ОбластьПодвал);
			
			ВысотаПодписи = ДокументРезультат.Области.Подвал.Низ - ДокументРезультат.Области.Подвал.Верх;
			
			ДокументРезультат.Области.Подвал.Видимость = ПоказыватьПодписи;
			
		

		// Первую колонку не печатаем
		ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
		
		// Присвоим имя для сохранения параметров печати табличного документа
		ДокументРезультат.ИмяПараметровПечати = "Распределения прибыли между обособленными подразделениями";
		
		УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(ДокументРезультат, ЗаголовокОтчета, Строка(глЗначениеПеременной("глТекущийПользователь")));
		
	КонецПроцедуры // СформироватьОтчет
	
	////////////////////////////////////////////////////////////////////////////////
	// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
	// 
	
	НП = Новый НастройкаПериода;
	
#КонецЕсли
